**Missing Values Analysis**

- It is vary important in data analysys

- It is a quite natural data set has missing values 

- There are so many techiniques are there : 
    
    - Mean
    
    - Median
    
    - Mode
    
    - bfill
    
    - fill
    
    - pad
    
    - random values
    
    - You can compare column values and you can impute
    
    - KNN imputer

In [2]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [3]:
d1.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [4]:
d1.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

In [5]:
dict2={'Names':['Ramesh','Suresh','Sathish','Null'],
     'Ages':[30,31,'Null',32],
      'City':['Null','Hyd',"Pune","Chennai"]}
             
d2=pd.DataFrame(dict1)
d2

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [6]:
d2.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [7]:
dict3={'Names':['Ramesh','Suresh','Sathish',None],
     'Ages':[30,31,None,32],
      'City':[None,'Hyd',"Pune","Chennai"]}
             
d3=pd.DataFrame(dict1)
d3

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [8]:
d3.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

- Values are not present, empty box is there === nul values 

- csv we dont have np.nan

- np.nan

- None is working

- Some times when you read csv if u have missing values it shows as Null

- isnull()-------------------------Best technique to used

## Method - 1 : Random filling

In [9]:
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [10]:
d1.fillna(40,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0       40
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3       40  32.0  Chennai

In [11]:
d1.dtypes

Names     object
Ages     float64
City      object
dtype: object

## Method -2 : Fill the random values only but based on the column

In [12]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [13]:
d1['Ages'].fillna(40,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3      NaN  32.0  Chennai

## Method -3 : 
   - **Mean**
    
   - **Median**
    
   - **Mode**

In [14]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

- Median does not affect by outilers 
- Mean affect by outliers 
- If you have a data is there ,
    - First check the outliers , by simple boxplot
    - You can ckeck with created outliers function
    - If u feel there is outliers are there 
    - Then fill missing values with median

In [15]:
age_mean=d1['Ages'].mean()
age_mean
d1['Ages'].fillna(31,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

In [16]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [17]:
age_median=d1['Ages'].median()
age_median
d1['Ages'].fillna(31,inplace=True)
d1

# It will not works bcz we overwrite it before line

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

In [18]:
# Mode is also work ;like mean and median

## Method -4:

   - pad
    
   - bfill
    
   - ffill
    
   - back.fill

# pad

In [20]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [21]:
d1.fillna(method='pad')
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [22]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [23]:
d1.fillna(method='pad',axis=0)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [24]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='pad',axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

# bfill

In [25]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='bfill',axis=0)

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [26]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='bfill',axis=1)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  Pune     Pune
3     32.0  32.0  Chennai

# ffill

In [27]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='ffill',axis=0)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [28]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='ffill',axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

# back.fill

In [29]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='backfill',axis=0)

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [30]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)
d1
d1.fillna(method='backfill',axis=1)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  Pune     Pune
3     32.0  32.0  Chennai

# - pad and ffill is same 
# - bfill and backfill both are same

## **Categorical Column**

- Categorical column mainly does not ahve any meaning in datafreames 
- IF it is some text or sentence you can find the meaning of the sentence 
- For example Names column is there , Review column is there 
- Becaues of only Name it self you cant judge the output
- But a review can impact the output
- Generally if any naive names kind of columns we can fill in any way 
- But if some columns impacting outputs , YEs we need to fill those columns 
- with an idea about how that column is related with other columns

## Method-5 : **KNN Imputer**
**KNN= k-nearest Neighbours**

- It is One ML model to find the nearest solution based on distance metrics 

- Instead of talking all the values of mean
- Why cant we take neighbour mean of the observations
- Here first will choose neighbours after
- It will calculate mean of those neighbours and fill with that values 

- **Package name** : **Sklearn.impute**
- **Method name** : **knnImputer**

- 
- you need to test with numerical as well as categorical

In [ ]:
d1.values  # ===============pass into the KNN imputer

In [ ]:
Step-1 : Read the Package---- (from sklearn.preprocessing import StandardScaler)

Step-2 : Save the Package----(SS=StandardScaler())

Step-3 : Apply fit transform--(le.fit_transform(visa_df['continent']))

In [8]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
     'Ages':[30,31,np.nan,32],
      'City':[np.nan,'Hyd',"Pune","Chennai"]}
             
d1=pd.DataFrame(dict1)

from sklearn.impute import KNNImputer
knn1= KNNImputer()
d1['Ages']=knn1.fit_transform(d1[['Ages']])
d1['Ages']

0    30.0
1    31.0
2    31.0
3    32.0
Name: Ages, dtype: float64

In [9]:
d1['Ages'].isnull().sum()

0

In [35]:
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai